const pairs = [
  {
    normalAlphabet: '1234567890',
    alphabets: [
      ['𝟣', '𝟤', '𝟥', '𝟦', '𝟧', '𝟨', '𝟩', '𝟪', '𝟫', '𝟢'],
      ['𝟙', '𝟚', '𝟛', '𝟜', '𝟝', '𝟞', '𝟟', '𝟠', '𝟡', '𝟘'],
      ['𝟷', '𝟸', '𝟹', '𝟺', '𝟻', '𝟼', '𝟽', '𝟾', '𝟿', '𝟶'],
      ['①', '②', '③', '④', '⑤', '⑥', '⑦', '⑧', '⑨', '⓪'],
      ['１', '２', '３', '４', '５', '６', '７', '８', '９', '０'],
      ['𝟏', '𝟐', '𝟑', '𝟒', '𝟓', '𝟔', '𝟕', '𝟖', '𝟗', '𝟎'],
    ],
  },
  {
    normalAlphabet: 'abcdefghijklmnopqrstuvwxyz',
    alphabets: [
      ['ä̤', 'b̤̈', 'c̤̈', 'd̤̈', 'ë̤', 'f̤̈', 'g̤̈', 'ḧ̤', 'ï̤', 'j̤̈', 'k̤̈', 'l̤̈', 'm̤̈', 'n̤̈', 'ö̤', 'p̤̈', 'q̤̈', 'r̤̈', 's̤̈', 'ẗ̤', 'ṳ̈', 'v̤̈', 'ẅ̤', 'ẍ̤', 'ÿ̤', 'z̤̈'],
      ['𝒶', '𝒷', '𝒸', '𝒹', '𝑒', '𝒻', '𝑔', '𝒽', '𝒾', '𝒿', '𝓀', '𝓁', '𝓂', '𝓃', '𝑜', '𝓅', '𝓆', '𝓇', '𝓈', '𝓉', '𝓊', '𝓋', '𝓌', '𝓍', '𝓎', '𝓏'],
      ['𝕒', '𝕓', '𝕔', '𝕕', '𝕖', '𝕗', '𝕘', '𝕙', '𝕚', '𝕛', '𝕜', '𝕝', '𝕞', '𝕟', '𝕠', '𝕡', '𝕢', '𝕣', '𝕤', '𝕥', '𝕦', '𝕧', '𝕨', '𝕩', '𝕪', '𝕫'],
      ['𝚊', '𝚋', '𝚌', '𝚍', '𝚎', '𝚏', '𝚐', '𝚑', '𝚒', '𝚓', '𝚔', '𝚕', '𝚖', '𝚗', '𝚘', '𝚙', '𝚚', '𝚛', '𝚜', '𝚝', '𝚞', '𝚟', '𝚠', '𝚡', '𝚢', '𝚣'],
      ['ⓐ', 'ⓑ', 'ⓒ', 'ⓓ', 'ⓔ', 'ⓕ', 'ⓖ', 'ⓗ', 'ⓘ', 'ⓙ', 'ⓚ', 'ⓛ', 'ⓜ', 'ⓝ', 'ⓞ', 'ⓟ', 'ⓠ', 'ⓡ', 'ⓢ', 'ⓣ', 'ⓤ', 'ⓥ', 'ⓦ', 'ⓧ', 'ⓨ', 'ⓩ'],
      ['ａ', 'ｂ', 'ｃ', 'ｄ', 'ｅ', 'ｆ', 'ｇ', 'ｈ', 'ｉ', 'ｊ', 'ｋ', 'ｌ', 'ｍ', 'ｎ', 'ｏ', 'ｐ', 'ｑ', 'ｒ', 'ｓ', 'ｔ', 'ｕ', 'ｖ', 'ｗ', 'ｘ', 'ｙ', 'ｚ'],
      ['𝘢', '𝘣', '𝘤', '𝘥', '𝘦', '𝘧', '𝘨', '𝘩', '𝘪', '𝘫', '𝘬', '𝘭', '𝘮', '𝘯', '𝘰', '𝘱', '𝘲', '𝘳', '𝘴', '𝘵', '𝘶', '𝘷', '𝘸', '𝘹', '𝘺', '𝘻'],
      ['𝙖', '𝙗', '𝙘', '𝙙', '𝙚', '𝙛', '𝙜', '𝙝', '𝙞', '𝙟', '𝙠', '𝙡', '𝙢', '𝙣', '𝙤', '𝙥', '𝙦', '𝙧', '𝙨', '𝙩', '𝙪', '𝙫', '𝙬', '𝙭', '𝙮', '𝙯'],
      ['𝔞', '𝔟', '𝔠', '𝔡', '𝔢', '𝔣', '𝔤', '𝔥', '𝔦', '𝔧', '𝔨', '𝔩', '𝔪', '𝔫', '𝔬', '𝔭', '𝔮', '𝔯', '𝔰', '𝔱', '𝔲', '𝔳', '𝔴', '𝔵', '𝔶', '𝔷'],
      ['𝖆', '𝖇', '𝖈', '𝖉', '𝖊', '𝖋', '𝖌', '𝖍', '𝖎', '𝖏', '𝖐', '𝖑', '𝖒', '𝖓', '𝖔', '𝖕', '𝖖', '𝖗', '𝖘', '𝖙', '𝖚', '𝖛', '𝖜', '𝖝', '𝖞', '𝖟'],
      ['𝓪', '𝓫', '𝓬', '𝓭', '𝓮', '𝓯', '𝓰', '𝓱', '𝓲', '𝓳', '𝓴', '𝓵', '𝓶', '𝓷', '𝓸', '𝓹', '𝓺', '𝓻', '𝓼', '𝓽', '𝓾', '𝓿', '𝔀', '𝔁', '𝔂', '𝔃'],
    ]
  },
  {
    normalAlphabet: 'ABCDEFGHIJKLMNOPQRSTUVWXYZ',
    alphabets: [
      ['🅰', '🅱', '🅲', '🅳', '🅴', '🅵', '🅶', '🅷', '🅸', '🅹', '🅺', '🅻', '🅼', '🅽', '🅾', '🅿', '🆀', '🆁', '🆂', '🆃', '🆄', '🆅', '🆆', '🆇', '🆈', '🆉'],
      ['ᗩ', 'ᗷ', 'ᑕ', 'ᗪ', 'ᗴ', 'ᖴ', 'Ǥ', 'ᕼ', 'Ꭵ', 'ᒎ', 'ᛕ', 'ᒪ', 'ᗰ', 'ᑎ', 'ᗝ', 'ᑭ', 'Ɋ', 'ᖇ', 'ᔕ', '丅', 'ᑌ', 'ᐯ', 'ᗯ', '᙭', 'Ƴ', '乙'],
      ['🄰', '🄱', '🄲', '🄳', '🄴', '🄵', '🄶', '🄷', '🄸', '🄹', '🄺', '🄻', '🄼', '🄽', '🄾', '🄿', '🅀', '🅁', '🅂', '🅃', '🅄', '🅅', '🅆', '🅇', '🅈', '🅉'],
      ['ꋫ', 'ꃃ', 'ꏸ', 'ꁕ', 'ꍟ', 'ꄘ', 'ꁍ', 'ꑛ', 'ꂑ', 'ꀭ', 'ꀗ', '꒒', 'ꁒ', 'ꁹ', 'ꆂ', 'ꉣ', 'ꁸ', '꒓', 'ꌚ', '꓅', 'ꐇ', 'ꏝ', 'ꅐ', 'ꇓ', 'ꐟ', 'ꁴ'],
      ['ꍏ', 'ꌃ', 'ꉓ', 'ꀸ', 'ꍟ', 'ꎇ', 'ꁅ', 'ꃅ', 'ꀤ', 'ꀭ', 'ꀘ', '꒒', 'ꂵ', 'ꈤ', 'ꂦ', 'ꉣ', 'ꆰ', 'ꋪ', 'ꌗ', '꓄', 'ꀎ', 'ꃴ', 'ꅏ', 'ꊼ', 'ꌩ', 'ꁴ'],
      ['Ꭿ', 'Ᏸ', 'Ꮸ', 'Ꭰ', 'Ꭼ', 'Ꮀ', 'Ꮆ', 'Ꮋ', 'Ꭸ', 'Ꮰ', 'Ꮶ', 'Ꮭ', 'Ꮇ', 'Ꮑ', 'Ꮎ', 'Ꮲ', 'Ꮕ', 'Ꮢ', 'Ꮥ', 'Ꮏ', 'Ꮼ', 'Ꮙ', 'Ꮿ', 'Ꮂ', 'Ꮍ', 'Ꮓ'],
      ['ƛ', 'Ɓ', 'Ƈ', 'Ɗ', 'Є', 'Ƒ', 'Ɠ', 'Ӈ', 'Ɩ', 'ʆ', 'Ƙ', 'Լ', 'M', 'Ɲ', 'Ơ', 'Ƥ', 'Ƣ', 'Ʀ', 'Ƨ', 'Ƭ', 'Ʋ', 'Ɣ', 'Ɯ', 'Ҳ', 'Ƴ', 'Ȥ'],
      ['𝒜', '𝐵', '𝒞', '𝒟', '𝐸', '𝐹', '𝒢', '𝐻', '𝐼', '𝒥', '𝒦', '𝐿', '𝑀', '𝒩', '𝒪', '𝒫', '𝒬', '𝑅', '𝒮', '𝒯', '𝒰', '𝒱', '𝒲', '𝒳', '𝒴', '𝒵'],
      ['𝔸', '𝔹', 'ℂ', '𝔻', '𝔼', '𝔽', '𝔾', 'ℍ', '𝕀', '𝕁', '𝕂', '𝕃', '𝕄', 'ℕ', '𝕆', 'ℙ', 'ℚ', 'ℝ', '𝕊', '𝕋', '𝕌', '𝕍', '𝕎', '𝕏', '𝕐', 'ℤ'],
      ['𝙰', '𝙱', '𝙲', '𝙳', '𝙴', '𝙵', '𝙶', '𝙷', '𝙸', '𝙹', '𝙺', '𝙻', '𝙼', '𝙽', '𝙾', '𝙿', '𝚀', '𝚁', '𝚂', '𝚃', '𝚄', '𝚅', '𝚆', '𝚇', '𝚈', '𝚉'],
      ['Ⓐ', 'Ⓑ', 'Ⓒ', 'Ⓓ', 'Ⓔ', 'Ⓕ', 'Ⓖ', 'Ⓗ', 'Ⓘ', 'Ⓙ', 'Ⓚ', 'Ⓛ', 'Ⓜ', 'Ⓝ', 'Ⓞ', 'Ⓟ', 'Ⓠ', 'Ⓡ', 'Ⓢ', 'Ⓣ', 'Ⓤ', 'Ⓥ', 'Ⓦ', 'Ⓧ', 'Ⓨ', 'Ⓩ'],
      ['Ａ', 'Ｂ', 'Ｃ', 'Ｄ', 'Ｅ', 'Ｆ', 'Ｇ', 'Ｈ', 'Ｉ', 'Ｊ', 'Ｋ', 'Ｌ', 'Ｍ', 'Ｎ', 'Ｏ', 'Ｐ', 'Ｑ', 'Ｒ', 'Ｓ', 'Ｔ', 'Ｕ', 'Ｖ', 'Ｗ', 'Ｘ', 'Ｙ', 'Ｚ'],
      ['𝘈', '𝘉', '𝘊', '𝘋', '𝘌', '𝘍', '𝘎', '𝘏', '𝘐', '𝘑', '𝘒', '𝘓', '𝘔', '𝘕', '𝘖', '𝘗', '𝘘', '𝘙', '𝘚', '𝘛', '𝘜', '𝘝', '𝘞', '𝘟', '𝘠', '𝘡'],
      ['𝘼', '𝘽', '𝘾', '𝘿', '𝙀', '𝙁', '𝙂', '𝙃', '𝙄', '𝙅', '𝙆', '𝙇', '𝙈', '𝙉', '𝙊', '𝙋', '𝙌', '𝙍', '𝙎', '𝙏', '𝙐', '𝙑', '𝙒', '𝙓', '𝙔', '𝙕'],
      ['𝔄', '𝔅', 'ℭ', '𝔇', '𝔈', '𝔉', '𝔊', 'ℌ', 'ℑ', '𝔍', '𝔎', '𝔏', '𝔐', '𝔑', '𝔒', '𝔓', '𝔔', 'ℜ', '𝔖', '𝔗', '𝔘', '𝔙', '𝔚', '𝔛', '𝔜', 'ℨ'],
      ['𝕬', '𝕭', '𝕮', '𝕯', '𝕰', '𝕱', '𝕲', '𝕳', '𝕴', '𝕵', '𝕶', '𝕷', '𝕸', '𝕹', '𝕺', '𝕻', '𝕼', '𝕽', '𝕾', '𝕿', '𝖀', '𝖁', '𝖂', '𝖃', '𝖄', '𝖅'],
      ['𝓐', '𝓑', '𝓒', '𝓓', '𝓔', '𝓕', '𝓖', '𝓗', '𝓘', '𝓙', '𝓚', '𝓛', '𝓜', '𝓝', '𝓞', '𝓟', '𝓠', '𝓡', '𝓢', '𝓣', '𝓤', '𝓥', '𝓦', '𝓧', '𝓨', '𝓩'],
    ]
  },
  {
    normalAlphabet: 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ',
    alphabets: [
      ['𝐚', '𝐛', '𝐜', '𝐝', '𝐞', '𝐟', '𝐠', '𝐡', '𝐢', '𝐣', '𝐤', '𝐥', '𝐦', '𝐧', '𝐨', '𝐩', '𝐪', '𝐫', '𝐬', '𝐭', '𝐮', '𝐯', '𝐰', '𝐱', '𝐲', '𝐳', '𝐀', '𝐁', '𝐂', '𝐃', '𝐄', '𝐅', '𝐆', '𝐇', '𝐈', '𝐉', '𝐊', '𝐋', '𝐌', '𝐍', '𝐎', '𝐏', '𝐐', '𝐑', '𝐒', '𝐓', '𝐔', '𝐕', '𝐖', '𝐗', '𝐘', '𝐙'],
      ['a̶', 'b̶', 'c̶', 'd̶', 'e̶', 'f̶', 'g̶', 'h̶', 'i̶', 'j̶', 'k̶', 'l̶', 'm̶', 'n̶', 'o̶', 'p̶', 'q̶', 'r̶', 's̶', 't̶', 'u̶', 'v̶', 'w̶', 'x̶', 'y̶', 'z̶', 'A̶', 'B̶', 'C̶', 'D̶', 'E̶', 'F̶', 'G̶', 'H̶', 'I̶', 'J̶', 'K̶', 'L̶', 'M̶', 'N̶', 'O̶', 'P̶', 'Q̶', 'R̶', 'S̶', 'T̶', 'U̶', 'V̶', 'W̶', 'X̶', 'Y̶', 'Z̶'],
      ['a̲̅', 'b̲̅', 'c̲̅', 'd̲̅', 'e̲̅', 'f̲̅', 'g̲̅', 'h̲̅', 'i̲̅', 'j̲̅', 'k̲̅', 'l̲̅', 'm̲̅', 'n̲̅', 'o̲̅', 'p̲̅', 'q̲̅', 'r̲̅', 's̲̅', 't̲̅', 'u̲̅', 'v̲̅', 'w̲̅', 'x̲̅', 'y̲̅', 'z̲̅', 'A̲̅', 'B̲̅', 'C̲̅', 'D̲̅', 'E̲̅', 'F̲̅', 'G̲̅', 'H̲̅', 'I̲̅', 'J̲̅', 'K̲̅', 'L̲̅', 'M̲̅', 'N̲̅', 'O̲̅', 'P̲̅', 'Q̲̅', 'R̲̅', 'S̲̅', 'T̲̅', 'U̲̅', 'V̲̅', 'W̲̅', 'X̲̅', 'Y̲̅', 'Z̲̅'],
      ['aͦ', 'bͦ', 'cͦ', 'dͦ', 'eͦ', 'fͦ', 'gͦ', 'hͦ', 'iͦ', 'jͦ', 'kͦ', 'lͦ', 'mͦ', 'nͦ', 'oͦ', 'pͦ', 'qͦ', 'rͦ', 'sͦ', 'tͦ', 'uͦ', 'vͦ', 'wͦ', 'xͦ', 'yͦ', 'zͦ', 'Aͦ', 'Bͦ', 'Cͦ', 'Dͦ', 'Eͦ', 'Fͦ', 'Gͦ', 'Hͦ', 'Iͦ', 'Jͦ', 'Kͦ', 'Lͦ', 'Mͦ', 'Nͦ', 'Oͦ', 'Pͦ', 'Qͦ', 'Rͦ', 'Sͦ', 'Tͦ', 'Uͦ', 'Vͦ', 'Wͦ', 'Xͦ', 'Yͦ', 'Zͦ'],
    ],
  },
]

// TODO: reduce number of replacers
const replacers: ((str: string) => string)[] = []
for (const { normalAlphabet, alphabets } of pairs) {
  const chars = normalAlphabet.split('')
  for (const idx in chars) {
    const char = chars[idx]
    const letters: string[] = alphabets.map(a => a[idx])
    const mappedLetters = letters.join('|')
    const regex = new RegExp(mappedLetters, 'g')
    replacers.push((str: string) => str.replace(regex, char))
  }
}

export const convertAesthetic = (str: string): string => {
  for (const replacer of replacers) {
    str = replacer(str)
  }
  return str
}
